import numpy as np
from sklearn.datasets import load_breast_cancer
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import MinMaxScaler
from xgboost import XGBClassifier
from sklearn.metrics import accuracy_score
import warnings

warnings.filterwarnings('ignore')

# 1. 데이터
x, y = load_breast_cancer(return_X_y=True)

x_train, x_test, y_train, y_test = train_test_split(x, y, random_state=777, train_size=0.8)

scaler = MinMaxScaler()
x_train = scaler.fit_transform(x_train)
x_test = scaler.transform(x_test)

# parameters = {
    
    
# }
parameters = {
    # 'objective': 'binary:logistic',  # 분류 문제인 경우 이진 분류를 위해 'binary:logistic'으로 설정합니다.
    # 'eval_metric': 'logloss',  # 모델 평가 지표로 로그 손실을 사용합니다.
    'max_depth': 6,  # 트리의 최대 깊이를 설정합니다.
    'learning_rate': 0.1,  # 학습률을 설정합니다.
    'n_estimators': 100,  # 트리의 개수를 설정합니다.
    'subsample': 0.8,  # 각 트리마다 사용될 샘플의 비율을 설정합니다.
    'colsample_bytree': 0.8,  # 각 트리마다 사용될 피처의 비율을 설정합니다.
    'reg_alpha': 0,  # L1 정규화 파라미터를 설정합니다.
    'reg_lambda': 1,  # L2 정규화 파라미터를 설정합니다.
    'random_state': 42  # 랜덤 시드를 설정합니다.
}

# 2. 모델

model = XGBClassifier()
model.set_params(early_stopping_rounds=10, **parameters)

# 3. 훈련
model.fit(x_train, y_train,
          eval_set=[(x_train, y_train), (x_test, y_test)],
          verbose=1,
          eval_metric='logloss'
          )

# 4. 평가, 예측
results = model.score(x_test, y_test)
print("최종 점수 : ", results)

y_predict = model.predict(x_test)
acc = accuracy_score(y_test, y_predict)
print("acc_score : ", acc)

###############################################################
print("------------------------------------------------------------")
# print(model.feature_importances_)
feature_importances = model.feature_importances_

print(feature_importances)
# print(x_train.shape)    #(455, 30) 

num_iterations = x_train.shape[1] - 1

for i in range(num_iterations) :
    
    feature_importances =  model.feature_importances_
    min_importance_index = np.argmin(feature_importances)
    min_importance = feature_importances[min_importance_index]
    
    x_train = np.delete(x_train, min_importance_index, axis=1)
    x_test = np.delete(x_test, min_importance_index, axis=1)

    print(x_train.shape, x_test.shape)
    
    model = XGBClassifier()
    model.set_params(early_stopping_rounds=10, **parameters)
    
    model.fit(x_train, y_train,
          eval_set=[(x_train, y_train), (x_test, y_test)],
          verbose=0,
          eval_metric='logloss'
          )
    
    # 4. 평가
    results = model.score(x_test, y_test)
    # print("최종 점수 : ", results)

    y_predict = model.predict(x_test)
    acc = accuracy_score(y_test, y_predict)
    # print("acc_score : ", acc)
    print(f"acc : {acc}")
    print(f"제거된 특성 {min_importance_index}의 중요도 : {min_importance}")
    print("-----------------------------------------------------------------------")
    
# (455, 29) (114, 29)
# acc : 0.9210526315789473
# 제거된 특성 14의 중요도 : 0.0011364775709807873
# -----------------------------------------------------------------------
# (455, 28) (114, 28)
# acc : 0.9210526315789473
# 제거된 특성 28의 중요도 : 0.0
# -----------------------------------------------------------------------
# (455, 27) (114, 27)
# acc : 0.9210526315789473
# 제거된 특성 18의 중요도 : 0.0030019208788871765
# -----------------------------------------------------------------------
# (455, 26) (114, 26)
# acc : 0.9385964912280702
# 제거된 특성 11의 중요도 : 0.002682013437151909
# -----------------------------------------------------------------------
# (455, 25) (114, 25)
# acc : 0.9298245614035088
# 제거된 특성 5의 중요도 : 0.0021859444677829742
# -----------------------------------------------------------------------
# (455, 24) (114, 24)
# acc : 0.9122807017543859
# 제거된 특성 21의 중요도 : 0.004341643303632736
# -----------------------------------------------------------------------
# (455, 23) (114, 23)
# acc : 0.9210526315789473
# 제거된 특성 2의 중요도 : 0.0
# -----------------------------------------------------------------------
# (455, 22) (114, 22)
# acc : 0.9298245614035088
# 제거된 특성 13의 중요도 : 0.004383957013487816
# -----------------------------------------------------------------------
# (455, 21) (114, 21)
# acc : 0.9298245614035088
# 제거된 특성 6의 중요도 : 0.0004169141175225377
# -----------------------------------------------------------------------
# (455, 20) (114, 20)
# acc : 0.9298245614035088
# 제거된 특성 20의 중요도 : 0.011244773864746094
# -----------------------------------------------------------------------
# (455, 19) (114, 19)
# acc : 0.9122807017543859
# 제거된 특성 10의 중요도 : 0.007149965967983007
# -----------------------------------------------------------------------
# (455, 18) (114, 18)
# acc : 0.9385964912280702
# 제거된 특성 10의 중요도 : 0.005888268817216158
# -----------------------------------------------------------------------
# (455, 17) (114, 17)
# acc : 0.9385964912280702
# 제거된 특성 10의 중요도 : 0.00514984643086791
# -----------------------------------------------------------------------
# (455, 16) (114, 16)
# acc : 0.9298245614035088
# 제거된 특성 8의 중요도 : 0.0069730994291603565
# -----------------------------------------------------------------------
# (455, 15) (114, 15)
# acc : 0.9298245614035088
# 제거된 특성 4의 중요도 : 0.008330896496772766
# -----------------------------------------------------------------------
# (455, 14) (114, 14)
# acc : 0.9298245614035088
# 제거된 특성 6의 중요도 : 0.01431694533675909
# -----------------------------------------------------------------------
# (455, 13) (114, 13)
# acc : 0.9210526315789473
# 제거된 특성 5의 중요도 : 0.008306133560836315
# -----------------------------------------------------------------------
# (455, 12) (114, 12)
# acc : 0.9210526315789473
# 제거된 특성 0의 중요도 : 0.0147848566994071
# -----------------------------------------------------------------------
# (455, 11) (114, 11)
# acc : 0.9122807017543859
# 제거된 특성 4의 중요도 : 0.01827850192785263
# -----------------------------------------------------------------------
# (455, 10) (114, 10)
# acc : 0.9210526315789473
# 제거된 특성 8의 중요도 : 0.02179005555808544
# -----------------------------------------------------------------------
# (455, 9) (114, 9)
# acc : 0.9210526315789473
# 제거된 특성 2의 중요도 : 0.01709592714905739
# -----------------------------------------------------------------------
# (455, 8) (114, 8)
# acc : 0.9210526315789473
# 제거된 특성 1의 중요도 : 0.020094873383641243
# -----------------------------------------------------------------------
# (455, 7) (114, 7)
# acc : 0.9298245614035088
# 제거된 특성 3의 중요도 : 0.03122778981924057
# -----------------------------------------------------------------------
# (455, 6) (114, 6)
# acc : 0.9298245614035088
# 제거된 특성 0의 중요도 : 0.03249901160597801
# -----------------------------------------------------------------------
# (455, 5) (114, 5)
# acc : 0.9210526315789473
# 제거된 특성 4의 중요도 : 0.057655323296785355
# -----------------------------------------------------------------------
# (455, 4) (114, 4)
# acc : 0.9210526315789473
# 제거된 특성 0의 중요도 : 0.07360909879207611
# -----------------------------------------------------------------------
# (455, 3) (114, 3)
# acc : 0.9122807017543859
# 제거된 특성 0의 중요도 : 0.12042887508869171
# -----------------------------------------------------------------------
# (455, 2) (114, 2)
# acc : 0.8947368421052632
# 제거된 특성 1의 중요도 : 0.10104582458734512
# -----------------------------------------------------------------------
# (455, 1) (114, 1)
# acc : 0.9035087719298246
# 제거된 특성 1의 중요도 : 0.49245306849479675
# -----------------------------------------------------------------------